Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The id of the priority queue to change.
zh_cn: 要更改的优先队列的id。

source: The id of the priority queue to copy from.
zh_cn: 要从中复制的优先队列的id。

source: The id of the priority queue to copy to.
zh_cn: 要复制到的优先队列的id。

source: The id of the priority queue to use.
zh_cn: 要使用的优先队列的id。

source: The id of the queue to add to.
zh_cn: 要添加的队列的id。

source: The id of the queue to dequeue from.
zh_cn: 要出队的队列的id。

source: The id of the socket to remove.
zh_cn: 要删除的套接字的id。

source: The id of the socket to use.
zh_cn: 要使用的套接字的id。

source: The id of the view to compare the mouse position to.
zh_cn: 要比较鼠标位置的视图id。

source: The idea is that if you have, for example, a pretty small tile set of 16 x 16 tiles then you have a total of 256 different tiles in your tile set, which only uses up 8 bits of your index in the tile data "blob" (from an available 19 bits of data).
zh_cn: 例如，如果你有一个非常小的16 x 16瓷砖的瓷砖集，那么你的瓷砖集中总共有256个不同的瓷砖，这只使用瓷砖数据"blob"中的8位索引(从可用的19位数据)。

source: The idea is that if you have, for example, pretty small tile sets of 16 x 16 tiles will have a total of 256 different tiles in each tile set, which only uses up 8 bits of your index in the tile data "blob" (from an available 19 bits of data).
zh_cn: 例如，如果你有一个很小的16 x 16瓷砖的瓷砖集，每个瓷砖集总共有256个不同的瓷砖，这只会占用瓷砖数据"blob"中索引的8位(从可用的19位数据)。

source: The image alpha of the icon (default 1).
zh_cn: 图标的图像alpha(默认为1)。

source: The image asset to get the texture from
zh_cn: 获取纹理的图像资源

source: The image below illustrates how different values affect the drawing of the sprite:
zh_cn: 下图说明了不同的值如何影响精灵的绘制:

source: The image below illustrates how gain affects the volume of the emitter when fall-off is greater than 0:
zh_cn: 图中说明了当衰减大于0时，增益如何影响发射器的音量:

source: The image below illustrates how this function works:
zh_cn: 下图说明了此函数是如何工作的:

source: The image below illustrates how this works:
zh_cn: 下图说明了这是如何工作的:

source: The image below illustrates this:
zh_cn: 下图说明了这一点:

source: The image below shows a visual representation of emitters and their relative positions to the listener:
zh_cn: 图中显示了发射器及其相对于侦听器的位置的直观表示:

source: The image below shows an example of how this works:
zh_cn: 下图展示了这是如何工作的:

source: The image below shows how a gear would typically be created in a game:
zh_cn: 下图显示了在游戏中通常如何创建装备:

source: The image below shows how each if the available functions relates to the device:
zh_cn: 下图显示了每个可用功能与设备的关系:

source: The image below shows how it is calculated:
zh_cn: 下图显示了它的计算方法:

source: The image below shows how this works:
zh_cn: 下图显示了这是如何工作的:

source: The image below shows the difference that can be seen when alpha testing is switched on or off:
zh_cn: 下图显示了当alpha测试被打开或关闭时所看到的差异:

source: The image below shows the result of this function with different sets of arguments:
zh_cn: 下图显示了此函数在不同参数集下的结果:

source: The image captured will be the final render of the application surface of the game, or (if the app surface has been disabled) it will be an image of the whole display or window.
zh_cn: 捕获的图像将是游戏应用程序表面的最终渲染，或者(如果应用程序表面已被禁用)它将是整个显示或窗口的图像。

source: The image index of the sprite.
zh_cn: 精灵的图像索引。

source: The image index to use for the background
zh_cn: 用于背景的图像索引

source: The image index to use for the sprite
zh_cn: 用于sprite的图像索引

source: The image_index of the sprite to draw.
zh_cn: 要绘制的精灵的image_index。

source: The image_index to get the attachment image from.
zh_cn: 要从中获取附件图像的image_index。

source: The images below illustrate this, with the image on the left being the default value of true and the image on the right being false:
zh_cn: 下图说明了这一点，左边的图像是默认值true，右边的图像是false:

source: The images themselves are NOT merged together, but rather the image indices are merged, with the sub images from sprite "ind2" appended onto those of sprite "ind1", ie: they are added on at the end.
zh_cn: 图像本身并不合并在一起，而是图像索引被合并，来自子画面"ind2"的子图像被附加到子画面"ind1"的子图像上，即:它们被添加在末尾。

source: The impulse (in Newton metres) to be applied
zh_cn: 要施加的冲量(单位为牛顿米)

source: The increase (or decrease if set negative) of the angle in degrees per step.
zh_cn: 每步角度的增加(或减少，如果设置为负),以度为单位。

source: The index (ID) of the particle group to delete.
zh_cn: 要删除的粒子组的索引(ID)。

source: The index (ID) of the particle to delete.
zh_cn: 要删除的粒子的索引(ID)。

source: The index (ID) of the particle to get the data from.
zh_cn: 要获取数据的粒子的索引(ID)。

source: The index (position) in the array to delete the value(s) from.
zh_cn: 数组中要从中删除值的索引(位置)。

source: The index (position) in the array to insert the value(s)
zh_cn: 在数组中插入值的索引(位置)

source: The index (resource name) of the sprite asset to flush
zh_cn: 要刷新的sprite资源的索引(资源名称)

source: The index (type) of the particles to be created.
zh_cn: 要创建的粒子的索引（类型）

source: The index into the array to start checking from
zh_cn: 要开始进行检查的数组的索引

source: The index is the UTF8 map number for the first character to use and the ranges to use are the same as you would for a normal font, starting with "!" but remember that you should only include what you need and that you should be using the ord() function to get the correct UTF8 value for the starting letter.
zh_cn: 索引是要使用的第一个字符的UTF8映射号，使用的范围与以"!"开头的普通字体相同，但请记住，您应该只包含您需要的内容，并且应该使用ord()函数来获取开头字母的正确UTF8值。

source: The index number of the light (arbitrary)
zh_cn: 灯的数字索引(任意)

source: The index number of the light (from 0 to 7)
zh_cn: 灯光的数字索引(从0到7)

source: The index of the DS Map to set the style from.
zh_cn: 用于设置样式的DS Map的索引。

source: The index of the array to check.
zh_cn: 要检查的数组的索引。

source: The index of the array to get the value from.
zh_cn: 要从中获取值的数组的索引。

source: The index of the array to resize.
zh_cn: 要调整大小的数组的索引。

source: The index of the array to set the value for.
zh_cn: 要设置值的数组的索引。

source: The index of the audio group to check (as defined in the Audio Groups Window)
zh_cn: 要检查的音频组的索引(在音频组窗口中定义)

source: The index of the audio group to check (as defined in the Audio Groups window)
zh_cn: 要检查的音频组的索引(在音频组窗口中定义)

source: The index of the audio group to load (as defined in the Audio Groups Window)
zh_cn: 要加载的音频组的索引(在音频组窗口中定义)

source: The index of the audio group to stop (as defined in the Audio Groups Window)
zh_cn: 要停止的音频组的索引(在"音频组"窗口中定义)

source: The index of the audio group to unload (as defined in the Audio Groups Window)
zh_cn: 要卸载的音频组的索引(在"音频组"窗口中定义)

source: The index of the buffer to change the size of.
zh_cn: 要更改大小的缓冲区的索引。

source: The index of the buffer to check.
zh_cn: 要检查的缓冲区的索引。

source: The index of the buffer to compress.
zh_cn: 要压缩的缓冲区的索引。

source: The index of the buffer to copy from.
zh_cn: 要从中复制的缓冲区的索引。

source: The index of the buffer to copy to.
zh_cn: 要复制到的缓冲区的索引。

source: The index of the buffer to decode the string into.
zh_cn: 要将字符串解码到的缓冲区的索引。

source: The index of the buffer to decompress.
zh_cn: 要解压缩的缓冲区的索引

source: The index of the buffer to delete.
zh_cn: 要删除的缓冲区的索引。

source: The index of the buffer to fill.
zh_cn: 要填充的缓冲区的索引。

source: The index of the buffer to get the size of.
zh_cn: 要获取大小的缓冲区的索引。

source: The index of the buffer to load into.
zh_cn: 要加载到的缓冲区的索引。

source: The index of the buffer to load.
zh_cn: 要加载的缓冲区的索引。

source: The index of the buffer to read from.
zh_cn: 要读取的缓冲区的索引。

source: The index of the buffer to save.
zh_cn: 要保存的缓冲区的索引。

source: The index of the buffer to use.
zh_cn: 要使用的缓冲区的索引。

source: The index of the buffer to write to.
zh_cn: 要写入的缓冲区的索引。

source: The index of the buffered sound to free.
zh_cn: 要释放的声音缓冲区索引。

source: The index of the camera to assign
zh_cn: 要指定的相机的索引

source: The index of the clickable icon to change.
zh_cn: 要更改的可单击图标的索引。

source: The index of the clickable icon to style.
zh_cn: 可点击图标的索引。

source: The index of the clickable to check.
zh_cn: 可点击检查的索引。

source: The index of the destination grid.
zh_cn: 目标网格的索引。

source: The index of the emitter to burst from.
zh_cn: 从其开始爆发的发射器的索引。

source: The index of the emitter to change.
zh_cn: 要更改的发射器的索引。

source: The index of the emitter to check the existence of.
zh_cn: 要检查是否存在的发射器的索引。

source: The index of the emitter to clear.
zh_cn: 要清除的发射器的索引。

source: The index of the emitter to destroy.
zh_cn: 要销毁的发射器的索引。

source: The index of the emitter to free.
zh_cn: 要释放的发射器的索引。

source: The index of the emitter to search for.
zh_cn: 要搜索的发射器的索引。

source: The index of the emitter to set.
zh_cn: 要设置的发射器的索引。

source: The index of the emitter to use.
zh_cn: 要使用的发射器的索引。

source: The index of the existing path to duplicate.
zh_cn: 要复制的现有路径的索引。

source: The index of the first array.
zh_cn: 第一个数组的索引。

source: The index of the first available character.
zh_cn: 第一个可用字符的索引。

source: The index of the fixture
zh_cn: 夹具的索引

source: The index of the font that shall be replaced (ie all references to this resource past this function will refer to the new font, not the original).
zh_cn: 将被替换的字体的索引(即，通过此函数对该资源的所有引用都将引用新字体，而不是原始字体)。

source: The index of the font to change the cache size of.
zh_cn: 要更改缓存大小的字体的索引。

source: The index of the font to delete.
zh_cn: 要删除的字体的索引。

source: The index of the font to use.
zh_cn: 要使用的字体索引。

source: The index of the font.
zh_cn: 字体的索引。

source: The index of the grid to read.
zh_cn: 要读取的网格的索引。

source: The index of the grid to shuffle.
zh_cn: 要随机播放的网格的索引。

source: The index of the grid to sort.
zh_cn: 要排序的网格的索引。

source: The index of the grid to write.
zh_cn: 要写入的网格的索引。

source: The index of the grid.
zh_cn: 网格的索引。

source: The index of the instance to draw the sprite from.
zh_cn: 绘制精灵的实例的索引。

source: The index of the joint that you wish to change
zh_cn: 您希望更改的关节的索引

source: The index of the joint that you wish to delete
zh_cn: 要删除的关节的索引

source: The index of the joint that you wish to test
zh_cn: 您希望测试的关节的索引

source: The index of the listener to get the gain of.
zh_cn: 索引的侦听器获得的增益。

source: The index of the listener to set the gain on.
zh_cn: 要设置增益的侦听器的索引。

source: The index of the object to change.
zh_cn: 要更改的对象的索引。

source: The index of the object to check
zh_cn: 要检查的对象的索引。

source: The index of the object to check.
zh_cn: 要检查的对象的索引。

source: The index of the original room to be duplicated.
zh_cn: 要复制的原始房间的索引。

source: The index of the particle system to change.
zh_cn: 要更改的粒子系统的索引。

source: The index of the particle system to check for.
zh_cn: 要检查的粒子系统的索引。

source: The index of the particle system to clear.
zh_cn: 要清除的粒子系统的索引。

source: The index of the particle system to destroy.
zh_cn: 要破坏的粒子系统的索引。

source: The index of the particle system to update.
zh_cn: 要更新的粒子系统的索引。

source: The index of the particle system.
zh_cn: 粒子系统的索引。

source: The index of the particle type to change.
zh_cn: 要更改的粒子类型的索引。

source: The index of the particle type to check for.
zh_cn: 要检查的粒子类型的索引。

source: The index of the particle type to clear.
zh_cn: 将索引的粒子类型清除。

source: The index of the particle type to create.
zh_cn: 要创建的粒子类型的索引。

source: The index of the particle type to destroy.
zh_cn: 要销毁的粒子类型的索引。

source: The index of the particle type to set.
zh_cn: 要设置的粒子类型的索引。

source: The index of the particle.
zh_cn: 粒子的索引。

source: The index of the path that will be appended to 'index'.
zh_cn: 将追加到"index"的路径的索引。

source: The index of the path that will overwrite 'index'.
zh_cn: 将覆盖"index"的路径的索引。

source: The index of the path to add the point to.
zh_cn: 要添加点的路径的索引。

source: The index of the path to be overwritten.
zh_cn: 要覆盖的路径的索引。

source: The index of the path to be used
zh_cn: 要使用的路径的索引

source: The index of the path to be used.
zh_cn: 要使用的路径的索引。

source: The index of the path to change a point of.
zh_cn: 要更改点的路径的索引。

source: The index of the path to change.
zh_cn: 要更改的路径的索引。

source: The index of the path to check for.
zh_cn: 要检查的路径的索引。

source: The index of the path to check.
zh_cn: 要检查的路径的索引。

source: The index of the path to clear.
zh_cn: 要清除的路径的索引。

source: The index of the path to delete a point from.
zh_cn: 要从中删除点的路径的索引。

source: The index of the path to delete.
zh_cn: 要删除的路径的索引。

source: The index of the path to flip.
zh_cn: 要翻转的路径的索引。

source: The index of the path to insert the point into.
zh_cn: 要插入点的路径的索引。

source: The index of the path to measure.
zh_cn: 要测量的路径的索引。

source: The index of the path to mirror.
zh_cn: 镜像路径的索引。

source: The index of the path to scale.
zh_cn: 要缩放的路径的索引。

source: The index of the queue to add to.
zh_cn: 要添加的队列的索引。

source: The index of the queue to free.
zh_cn: 要释放的队列的索引。

source: The index of the recorder channel to stop.
zh_cn: 要停止的录音机通道的索引。

source: The index of the recorder source to get the information from.
zh_cn: 从中获取信息的录音机源的索引。

source: The index of the recorder source to use.
zh_cn: 要使用的录音机源的索引。

source: The index of the room to add an object instance to.
zh_cn: 要添加对象实例的房间的索引。

source: The index of the room to be copied from.
zh_cn: 要复制的房间的索引。

source: The index of the room to be copied to.
zh_cn: 要复制到的房间的索引。

source: The index of the room to check the name of.
zh_cn: 要查名字的房间索引。

source: The index of the room to check.
zh_cn: 要查的房间索引。

source: The index of the room to clear all instances in.
zh_cn: 要清除其中所有实例的房间的索引。

source: The index of the room to get the next one after.
zh_cn: 要获取下一个房间的房间索引。

source: The index of the room to get the one before from.
zh_cn: 要从中获取前一个房间的房间索引。

source: The index of the room to get the view camera of
zh_cn: 获取摄像头视图的房间索引

source: The index of the room to get viewport data from
zh_cn: 要从中获取视口数据的房间的索引

source: The index of the room to go to.
zh_cn: 要去的房间的索引。

source: The index of the room to set
zh_cn: 要设置的房间的索引

source: The index of the room to set the height of.
zh_cn: 要设置高度的房间的索引。

source: The index of the room to set the persistence of.
zh_cn: 要设置持久性的房间的索引。

source: The index of the room to set the view camera of
zh_cn: 要设置相机的房间的索引

source: The index of the room to set the width of.
zh_cn: 要设置宽度的房间的索引。

source: The index of the room to set.
zh_cn: 要设置的房间的索引。

source: The index of the script function to add into the moment.
zh_cn: 要添加到时刻中的脚本函数的索引。

source: The index of the script that you want to get the name of.
zh_cn: 要获取其名称的脚本的索引。

source: The index of the second array.
zh_cn: 第二个数组的索引。

source: The index of the shader sampler to get
zh_cn: 要获取的着色器采样器的索引

source: The index of the shader sampler to get.
zh_cn: 要获取的着色器采样器的索引。

source: The index of the shader to get the name of.
zh_cn: 要获取名称的着色器的索引。

source: The index of the shader to use.
zh_cn: 要使用的着色器的索引。

source: The index of the sound to change.
zh_cn: 要更改的声音的索引。

source: The index of the sound to check the existence of.
zh_cn: 索引的声音检查是否存在。

source: The index of the sound to check.
zh_cn: 要检查的声音的索引。

source: The index of the sound to get the gain of.
zh_cn: 要获取增益的声音的索引。

source: The index of the sound to get the pitch of.
zh_cn: 要获取音高的声音的索引。

source: The index of the sound to get the play position of.
zh_cn: 要获取其播放位置的声音的索引。

source: The index of the sound to pause.
zh_cn: 要暂停的声音的索引。

source: The index of the sound to play.
zh_cn: 要播放的声音的索引。

source: The index of the sound to resume.
zh_cn: 要恢复的声音的索引。

source: The index of the sound to set the gain for.
zh_cn: 要设置增益的声音的索引。

source: The index of the sound to stop.
zh_cn: 要停止的声音的索引。

source: The index of the sound to use.
zh_cn: 要使用的声音的索引。

source: The index of the source grid.
zh_cn: 源网格的索引。

source: The index of the sprite from which the Nine Slice struct will be retrieved
zh_cn: 将从中检索九宫格结构的sprite的索引

source: The index of the sprite that ind1 is to be merged with.
zh_cn: ind1要与之合并的sprite的索引。

source: The index of the sprite to add the new image to.
zh_cn: 要添加新图像的sprite的索引。

source: The index of the sprite to be copied to (ie: overwritten).
zh_cn: 要复制到的精灵的索引(即:被覆盖)。

source: The index of the sprite to be deleted.
zh_cn: 要删除的精灵的索引。

source: The index of the sprite to change the cache size of.
zh_cn: 这适用于精灵的所有子图像。

source: The index of the sprite to change the mode of.
zh_cn: 要更改其模式的sprite的索引。

source: The index of the sprite to change the offset of.
zh_cn: 要更改偏移量的sprite的索引。

source: The index of the sprite to change the transparency map of.
zh_cn: 要更改其透明度映射的精灵的索引。

source: The index of the sprite to check.
zh_cn: 要检查的sprite的索引。

source: The index of the sprite to draw.
zh_cn: 要绘制的精灵的索引。

source: The index of the sprite to duplicate.
zh_cn: 要复制的sprite的索引。

source: The index of the sprite to find the height of.
zh_cn: 要查找其高度的sprite的索引。

source: The index of the sprite to find the texture page entry of.
zh_cn: 要查找其纹理页面条目的sprite的索引。

source: The index of the sprite to find the width of.
zh_cn: 要查找其宽度的sprite的索引。

source: The index of the sprite to find the xoffset of.
zh_cn: 要查找其x偏移的sprite的索引。

source: The index of the sprite to find the yoffset of.
zh_cn: 要查找其y偏移的sprite的索引。

source: The index of the sprite to get the animation type of
zh_cn: 要获取其动画类型的sprite的索引

source: The index of the sprite to get the information for.
zh_cn: 要获取其信息的sprite的索引。

source: The index of the sprite to get the name of.
zh_cn: 要获取其名称的sprite的索引。

source: The index of the sprite to get the speed of
zh_cn: 要获取其速度的sprite的索引。

source: The index of the sprite to merge.
zh_cn: 要合并的sprite的索引。

source: The index of the sprite to modify
zh_cn: 要修改的sprite的索引

source: The index of the sprite to permanently replace.
zh_cn: 要永久替换的sprite的索引。

source: The index of the sprite to save.
zh_cn: 要保存的sprite的索引。

source: The index of the sprite to set the bounding box of.
zh_cn: 要设置其边框的sprite的索引。

source: The index of the sprite to set the bounding box on.
zh_cn: 要设置边框的sprite的索引。

source: The index of the sprite to set the particle type to.
zh_cn: 设置粒子类型的精灵的索引。

source: The index of the sprite to take the transparency map data from.
zh_cn: 要从中获取透明度贴图数据的sprite的索引。

source: The index of the sprite to use.
zh_cn: 要使用的精灵的索引。

source: The index of the sprite.
zh_cn: 精灵的索引。

source: The index of the surface from which the get the image.
zh_cn: 从中获取图像的表面的索引。

source: The index of the surface to create from.
zh_cn: 要创建的表面的索引。

source: The index of the surface to use.
zh_cn: 要使用的表面的索引。

source: The index of the tile set to get the name of.
zh_cn: 要获取其名称的图块集的索引。

source: The index of the tile set to use.
zh_cn: 要使用的图块集的索引。

source: The index of the time line to add a moment to.
zh_cn: 要添加时刻的时间线的索引。

source: The index of the time line to check for.
zh_cn: 要检查的时间线的索引。

source: The index of the time line to check the name of.
zh_cn: 要检查其名称的时间线的索引。

source: The index of the time line to clear.
zh_cn: 要清除的时间线的索引。

source: The index of the time line to delete.
zh_cn: 要删除的时间线的索引。

source: The index of the time source
zh_cn: 时间源的索引

source: The index of the timeline get the information from.
zh_cn: 获取信息的时间轴的索引。

source: The index of the timeline to get the last moment of.
zh_cn: 要获取其最后时刻的时间轴的索引。

source: The index of the vertex buffer to copy from.
zh_cn: 要从中复制的顶点缓冲区的索引。

source: The index of the view port to assign the camera to
zh_cn: 将摄影机指定给的视口的索引

source: The index of the view port to get
zh_cn: 要获取的视图端口的索引

source: The index of the view port to get the camera of
zh_cn: 获取相机的视图端口的索引

source: The index of the view port to set
zh_cn: 要设置的视口的索引

source: The index of the virtual key to delete.
zh_cn: 要删除的虚拟键的索引。

source: The index of the virtual key to hide.
zh_cn: 要隐藏的虚拟键的索引。

source: The index of the virtual key to show.
zh_cn: 要显示的虚拟键的索引。

source: The index value constant of the audio group to check (as defined in the Audio Groups Window)
zh_cn: 要检查的音频组的索引值常量(在音频组窗口中定义)

source: The index value is the particle ID as returned by the function physics_particle_create(), while the flags are the return value of a combination of the following constants:
zh_cn: 索引值是由函数physics_particle_create()返回的粒子ID，而标志是以下常量组合的返回值:

source: The index with the array to start copying from.
zh_cn: 开始复制的数组的索引。

source: The index within the array to copy to.
zh_cn: 要复制到的数组中的索引。

source: The index within the instance list from 0 - (instance count - 1).
zh_cn: 实例列表中从0 -(实例计数- 1)开始的索引。

source: The indicated path must already exist and it will be overwritten by the new path.
zh_cn: 指示的路径必须已经存在，并且将被新路径覆盖。

source: The indicated path must already exist and will be overwritten by the new path and the function will return if a complete path was found (true) or not (false).
zh_cn: 指示的路径必须已经存在，并将被新路径覆盖，如果找到完整的路径(true)或没有找到完整的路径(false)，函数将返回。

source: The initial angular velocity.
zh_cn: 初始角速度。

source: The initial horizontal velocity.
zh_cn: 初始水平速度。

source: The initial size of the buffer (in bytes).
zh_cn: 缓冲区的初始大小(以字节为单位)。

source: The initial value to be used for the previous element.
zh_cn: 用于前一个元素的初始值。

source: The initial vertical velocity.
zh_cn: 初始垂直速度。

source: The input string format.
zh_cn: 输入字符串格式。

source: The input string.
zh_cn: 输入字符串。

source: The input to check.
zh_cn: 要检查的输入。

source: The input value must be a power of two value and will work such that:
zh_cn: 输入值必须是两个值的幂，并将工作如下:

source: The input value must range between 1 and 16.
zh_cn: 输入值必须介于1和16之间。

source: The input value.
zh_cn: 输入值。

source: The input values of the function are the (previously created) DS map to use and the key to check for.
zh_cn: 此函数的输入值是要使用的(先前创建的)DS map和要检查的键。

source: The instance ID or object_index to destroy (optional, default is the calling instance)
zh_cn: 要销毁的实例ID或object_index(可选，默认是调用的实例)

source: The instance or object to check for.
zh_cn: 要检查的实例或对象。

source: The integer index value of the tile set to use
zh_cn: 要使用的图块集的整数索引值

source: The integer value (or values) to set the shader constant to.
zh_cn: 要设置着色器常量的整数值(或多个值)。

source: The joint angle to maintain
zh_cn: 要保持的关节角度

source: The joint that you wish to enable or disable the motor on
zh_cn: 您希望启用或禁用马达的关节

source: The key (along with its associated value) to delete.
zh_cn: 要删除的键(及其关联值)。

source: The key for the added list.
zh_cn: 已添加列表的键。

source: The key for the added map.
zh_cn: 已添加映射的键。

source: The key of the value to add.
zh_cn: 要添加值的键。

source: The key to check for.
zh_cn: 要检查的键。

source: The key to check the down state of.
zh_cn: 该键用于检查down状态。

source: The key to check the pressed state of.
zh_cn: 检查按下状态的键。

source: The key to check the released state of.
zh_cn: 用于检查的释放状态的键。

source: The key to check.
zh_cn: 要检查的键。

source: The key to clear.
zh_cn: 关键在于清除。

source: The key to delete.
zh_cn: 要删除的键。

source: The key to find the next one to.
zh_cn: 找到下一把键。

source: The key to find the previous one to.
zh_cn: 找到上一个键。

source: The key to find.
zh_cn: 要查找的键。

source: The key to replace.
zh_cn: 要替换的键。

source: The key to set.
zh_cn: 要设置的key。

source: The key to simulate a press of.
zh_cn: 模拟按压的键。

source: The key to simulate a release of.
zh_cn: 模拟释放的键。

source: The key with the value that should be replaced by the new one
zh_cn: 带有应该被新值替换的值的键

source: The key within the relevant section of the .ini to read from.
zh_cn: 要读取的 .ini 相关节中的键。

source: The key within the relevant section of the .ini to write to.
zh_cn: 要写入的 .ini 相关节中的键。

source: The keys and and values you supply can be made up of any combination of data types, so all of the following - and more - are acceptable (although, in practice, you would most commonly use a string for the key):
zh_cn: 您提供的键和以及值可以由任何数据类型的组合组成，因此以下所有内容以及更多内容都是可以接受的(尽管在实践中，您最常用的键是字符串):

source: The kind of effect (use one of the constants listed above).
zh_cn: 效果的种类(使用上面列出的常量之一)。

source: The kind of mask, a constant (see the table in the description).
zh_cn: 掩码的种类，一个常量(见说明中的表格)。

source: The kind of primitive you are going to draw.
zh_cn: 你要绘制的图元类型。

source: The kind of the path, 0 for straight or 1 for smooth.
zh_cn: 路径的种类，0表示直线，1表示平滑。

source: The last character to include (if you're unsure, go for 128).
zh_cn: 最后一个要包含的字符(如果不确定，可以选择128(英语))。

source: The layer ID (or name) to assign the created instance to
zh_cn: 要将创建的实例分配到的层ID(或名称)

source: The layer ID string (or value) to be used
zh_cn: 要使用的层ID字符串(或值)

source: The layer ID value or string to assign the particle system to (can be any layer type)
zh_cn: 指定粒子系统的层ID值或字符串(可以是任何层类型)

source: The layer can be identified using the layer ID value (as returned by the function layer_create()) or by the name of the layer (as a string, for example "instance_layer") as defined in the room editor.
zh_cn: 可以使用层ID值(由layer_create()函数返回)或房间编辑器中定义的层名(作为字符串，例如"instance_layer")来识别层。
